In [37]:
import pandas as pd
import numpy as np
import re

In [51]:
pop = pd.read_excel('2018-epi-raw-data-time-series.xlsx',sheet_name='POP')

In [52]:
pop.drop(columns=['code','iso'],inplace=True)

In [53]:
pop_corrected = pd.melt(pop,id_vars =['country'])

In [54]:
pop_corrected['variable'] = pop_corrected['variable'].apply(lambda x: re.sub(r'\bPOP.','',x))
pop_corrected.rename(columns = {'variable':'year','value':'population'}, inplace = True)

In [55]:
pop_corrected = pop_corrected[pop_corrected['year']!='2015']
pop_corrected = pop_corrected[pop_corrected['year']!='2016']

In [56]:
pop_corrected

                        country  year  population
0                   Afghanistan  1997  18381605.0
1                       Albania  1997   3148281.0
2                       Algeria  1997  29886839.0
3                American Samoa  1997     54941.0
4                       Andorra  1997     64327.0
...                         ...   ...         ...
4243  Wallis and Futuna Islands  2014         NaN
4244             Western Sahara  2014         NaN
4245                      Yemen  2014  26246327.0
4246                     Zambia  2014  15620974.0
4247                   Zimbabwe  2014  15411675.0

[4248 rows x 3 columns]

In [57]:
pop_corrected.dtypes

country        object
year           object
population    float64
dtype: object

## Replace NaN values using interpolation

In [58]:
pop_corrected.isna().sum()

country         0
year            0
population    361
dtype: int64

In [59]:
pop_corrected = pop_corrected.interpolate()

In [60]:
pop_corrected.isna().sum()

country       0
year          0
population    0
dtype: int64

## Export csv corrected

In [62]:
pop_corrected.to_excel('pop_corr.xlsx')

In [61]:
pop_corrected.to_csv('pop_corr.csv')

# SQL

In [30]:
import requests
import getpass
import mysql.connector
import getpass

In [31]:
psw = getpass.getpass()

In [32]:
cnx = mysql.connector.connect(user='root', password=psw, 
                              host='localhost', database='ironhack', use_pure=True)

In [33]:
# see if is connected
if cnx.is_connected():
    print('You are connected to the databse')
else:
    print('Connection is not open')

You are connected to the databse

In [ ]:
# we need to define the object we will use to interact with the database
cursor = cnx.cursor()

In [36]:
pop_corrected.dtypes

country        object
year           object
population    float64
dtype: object

In [ ]:
# simple querry to create a table in ironhack_personell database named 'names' with three columns (studens, age, school):

    ### ALSO CHECK IF YOUR QUERIES WERE WELL DONE ###
    
querry = ("CREATE TABLE IF NOT EXISTS "
"population ("
"country VARCHAR(50) PRIMARY KEY ,"
"year VARCHAR(8),"
"pop FLOAT)")

In [ ]:
# this line executes the above querry to create an empty table in MySQL
cursor.execute(querry)

In [ ]:
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw=psw,
                               db="Ironhack"))


df.to_sql('names', con = engine, if_exists = "append", index=False)

In [35]:
# saving any changes you did on the database
cnx.commit()
# clear the cursor
cursor.close()
# closes the door between python and SQL
cnx.close()